Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: If this parameter is 0, the open clipboard is associated with the current task.
fr: Si ce paramètre vaut 0, le presse-papiers ouvert est associé à la tâche en cours.

source: This function fails if another window has the clipboard open.
fr: Cette fonction échoue si une autre fenêtre a le presse-papiers ouvert.

source: Call the _ClipBoard_Close() function after every successful call to this function.
fr: Appelez la fonction _ClipBoard_Close() après chaque appel réussi à cette fonction.

source: The window identified by the $hOwner parameter does not become the clipboard owner unless the _ClipBoard_Empty() function is called.
fr: La fenêtre identifiée par le paramètre $hOwner ne devient pas le propriétaire du presse-papiers à moins que la fonction _ClipBoard_Empty() soit appelée.

source: If you call _ClipBoard_Open() with hwnd set to 0, _ClipBoard_Empty() sets the clipboard owner to 0 which causes _ClipBoard_SetData() to fail.
fr: Si vous appelez _ClipBoard_Open() avec hwnd défini à 0, _ClipBoard_Empty() définit le propriétaire du presse-papiers à 0 ce qui provoque l'échec de _ClipBoard_SetData().

source: Search OpenClipboard in MSDN Library
fr: Consultez OpenClipboard dans la Librairie MSDN.

source: Registers a new clipboard format
fr: Enregistre un nouveau format de presse-papiers

source: The name of the new format
fr: Le nom du nouveau format

source: The registered clipboard format
fr: Retourne le format enregistré de presse-papiers

source: If a registered format with the specified name already exists, a new format is not registered and the return value identifies the existing format.
fr: Si un format enregistré avec le nom spécifié existe déjà, le nouveau format n'est pas enregistré et la valeur de retour identifie le format existant.

source: This enables more than one application to copy and paste data using the same registered clipboard format.
fr: Cela permet à plus d'une application de copier et coller des données en utilisant le même format enregistré de presse-papiers.

source: Note that the format name comparison is case-insensitive.
fr: Notez que la comparaison des noms de format n'est pas sensible à la casse.

source: Search RegisterClipboardFormat in MSDN Library
fr: Consultez RegisterClipboardFormat dans la Librairie MSDN.

source: Places data on the clipboard in a specified clipboard format
fr: Place des données dans le presse-papiers dans un format spécifié de presse-papiers

source: Data in Binary or String format, or optionally NULL (0) (owner must render, see below).
fr: Données au format Binary ou String, ou éventuellement NULL(0) (propriétaire doit rendre, voir ci-dessous ).

source: If a String is passed, and it is not of type $CF_TEXT, $CF_OEMTEXT, or $CF_UNICODETEXT, it will be treated as an ANSI string.
fr: Si le format est String, et que la chaîne n'est pas de type $CF_TEXT, $CF_OEMTEXT, ou $CF_UNICODETEXT, elle sera traitée comme une chaîne ANSI.

source: To force Unicode strings for other types, you must pass the data in Binary format.
fr: Pour forcer une chaîne Unicode en un autre type, vous devez transmettre les données au format binaire.

source: Also, do NOT pass $CF_UNICODETEXT in Binary format (causes garbled data).
fr: Aussi, ne PAS passer $CF_UNICODETEXT au format binaire (brouillage des données ).

source: When $vData is NULL, it indicates that the window provides data in the specified clipboard format upon request.
fr: Lorsque $vData est NULL, cela indique que la fenêtre fournit des données dans le format spécifié du presse-papiers, sur demande.

source: If a window delays rendering, it must process the $WM_RENDERFORMAT and $WM_RENDERALLFORMATS messages.
fr: Si une fenêtre retarde à s'afficher, elle doit traiter les messages $WM_RENDERFORMAT et $WM_RENDERALLFORMATS.

source: If this function succeeds, the system owns the object identified by the $hMemory parameter.
fr: Si cette fonction réussit, le système s'approprie l'objet identifié par le paramètre $hMEMORY.

source: The application may not write to or free the data once ownership has been transferred to the system, but it can lock and read from the data until the _ClipBoard_Close() function is called.
fr: L'application ne peut écrire ou libérer les données une fois que la propriété a été transférée au système, mais elle peut verrouiller et lire les données jusqu'à ce que la fonction _ClipBoard_Close() soit appelée.

source: The memory must be unlocked before the clipboard is closed.
fr: La mémoire doit être déverrouillée avant que le presse-papiers soit fermé.

source: If the $hMemory parameter identifies a memory object, the object must have been allocated using the function with the $GMEM_MOVEABLE flag.
fr: Si le paramètre $hMEMORY identifie un objet mémoire, l'objet doit avoir été alloué à l'aide de la fonction avec le flag $GMEM_MOVEABLE.

source: The handle to the data
fr: Retourne le handle des données

source: This function performs all of the steps neccesary to put data on the clipboard.
fr: Cette fonction effectue toutes les étapes nécessaires pour placer les données dans le presse-papiers.

source: It will allocate the global memory object, open the clipboard, place the data on the clipboard and close the clipboard.
fr: Elle va allouer un objet de mémoire globale, ouvrir le presse-papiers, placer les données dans le presse-papiers et fermer le presse-papiers.

source: If you need more control over putting data on the clipboard, you may want to use the _ClipBoard_SetDataEx() function.
fr: Si vous avez besoin de plus de contrôle sur la mise en place des données dans le presse-papiers, vous pouvez utiliser la fonction _ClipBoard_SetDataEx().

source: Handle to the data in the specified format.
fr: Handle des données dans le format spécifié.

source: This parameter can be NULL, indicating that the window provides data in the specified clipboard format upon request.
fr: Ce paramètre peut être NULL, ce qui indique que la fenêtre fournit des données dans le format spécifié du presse-papiers sur demande.

source: The $iFormat parameter can identify a registered clipboard format, or it can be one of the standard clipboard formats.
fr: Le paramètre $iFormat peut identifier un format de presse-papiers enregistré, ou il peut être l'un des formats standards du presse-papiers.

source: If an application calls this function in response to $WM_RENDERFORMAT or $WM_RENDERALLFORMATS, the application should not use the handle after this function has been called.
fr: Si une application appelle cette fonction en réponse à $WM_RENDERFORMAT ou $WM_RENDERALLFORMATS, l'application ne doit pas utiliser le handle après que cette fonction ait été appelée.

source: If an application calls _ClipBoard_Open() with a NULL handle, _ClipBoard_Empty() sets the clipboard owner to NULL; this causes this function to fail.
fr: Si une application appelle _ClipBoard_Open() avec un handle NULL, _ClipBoard_Empty() définit le propriétaire du presse-papiers à NULL; ce qui fait échouer la fonction.

source: Search SetClipboardData in MSDN Library
fr: Consultez SetClipboardData dans la Librairie MSDN.

source: Open clipboard
fr: Ouvrir le presse-papiers

source: Empty clipboard
fr: Presse-papiers vide

source: Create global memory buffer (show why using _ClipBoard_SetData is MUCH easier!)
fr: Crée tampon de mémoire global (montre pourquoi l'utilisation de _ClipBoard_SetData est beaucoup plus facile!)

source: Write clipboard text
fr: Ecrit du texte dans le presse-papiers

source: Close clipboard
fr: Ferme le presse-papiers

source: Adds the specified window to the chain of clipboard viewers
fr: Ajoute la fenêtre spécifiée à la chaîne des vues du presse-papiers

source: Handle to the window to be added to the clipboard chain
fr: Handle de la fenêtre à ajouter à la chaîne du presse-papiers

source: The handle to the next window in the clipboard viewer chain
fr: Retourne le handle de la fenêtre suivante dans la chaîne des vues du presse-papiers

source: The windows that are part of the clipboard viewer chain must process the clipboard messages $WM_CHANGECBCHAIN and $WM_DRAWCLIPBOARD.
fr: Les fenêtres qui font partie de la chaîne des vues du presse-papiers doivent traiter les messages $WM_CHANGECBCHAIN ​et $WM_DRAWCLIPBOARD.

source: Each clipboard viewer window calls the _SendMessage() function to pass these messages to the next window in the clipboard viewer chain.
fr: Chaque fenêtre des vues du presse-papiers appelle la fonction _SendMessage() pour passer ces messages à la fenêtre suivante dans la chaîne des vues.

source: A clipboard viewer window must eventually remove itself from the clipboard viewer chain by calling the _ClipBoard_ChangeChain() function.
fr: Une fenêtre de vue du presse-papiers doit finalement se retirer de la chaîne en appelant la fonction _ClipBoard_ChangeChain().

source: Search SetClipboardViewer in MSDN Library
fr: Consultez SetClipboardViewer dans la Librairie MSDN.

source: Converts HSL to RGB
fr: Convertit HSL en RGB

source: An array containing HSL values in their respective positions
fr: Un tableau contenant des valeurs HSL dans leurs positions respectives

source: the array containing the RGB values for the inputted HSL values.
fr: Retourne le tableau contenant les valeurs RVB pour les valeurs HSL entrées.

source: See:
fr: Consultez :

source: Converts RGB to HSL
fr: Convertit RGB en HSL

source: An array containing RGB values in their respective positions
fr: Un tableau contenant les valeurs RVB dans leurs positions respectives

source: the array containing the HSL values for the inputted RGB values
fr: Retourne le tableau contenant les valeurs de HSL pour les valeurs RGB introduites

source: Returns the blue component of a given color
fr: Retourne la composante bleue d'une couleur donnée

source: The RGB color to work with (0x00RRGGBB).
fr: La couleur RVB au format (0x00RRVVBB).

source: Returns the component color in the range 0-255.
fr: Retourne la composante bleue dans l'intervalle 0-255.

source: Returns the COLORREF color
fr: Retourne la couleur COLORREF

source: the COLORREF color to work with (0x00BBGGRR)
fr: La couleur COLORREF sous la forme (0x00BBGGRR)

source: an array of values in the range 0-255:
fr: Retourne le tableau de valeurs comprises entre 0 et 255:

source: [0] Red component color
fr: [0] Rouge

source: [1] Green component color
fr: [1] Vert

source: [2] Blue component color
fr: [2] Bleu

source: @extended is preserved.
fr: @extended est conservé.

source: Returns the green component of a given color
fr: Retourne la composante verte d'une couleur donnée

source: Returns the red component of a given color
fr: Retourne la composante rouge d'une couleur donnée

source: Returns an array containing RGB values in their respective positions
fr: Retourne un tableau contenant les valeurs RVB dans leurs positions respectives

source: the COLORREF color to work with 0x00BBGGRR.
fr: Retourne la couleur COLORREF au format 0x00BBGGRR.

source: 1 invalid array
fr: 1 tableau invalide

source: 2 invalid color value
fr: 2 valeur de couleur invalide

source: Returns the RGB color
fr: Retourne la couleur RGB

source: the RGB color to work with 0x00RRGGBB.
fr: Retourne la couleur RVB sous la forme 0x00RRVVBB.

source: Creates an adjustable arrow line cap with the specified height and width
fr: Crée un embout de flèche, réglable en hauteur et en largeur, et pouvant être plein ou creux

source: Specifies the length, in units, of the arrow from its base to its point
fr: Spécifie la mesure, en unités, de l'embout depuis sa base jusqu'à la pointe

source: Specifies the distance, in units, between the corners of the base of the arrow
fr: Spécifie, en unités, la largeur de la base de l'embout de la flèche

source: Fill flag:
fr: Paramètre de remplissage:

source: True - Arrow will be filled
fr: True - Embout de flèche plein

source: False - Arrow will not be filled
fr: False – Embout de flèche creux

source: a handle to a new arrowCap object.
fr: Retourne le handle du nouvel objet 'embout de flèche'

source: sets the @error flag to non-zero, @extended may contain GPSTATUS error code ($GPID_ERR*).
fr: Retourne @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*)

source: After you are done with the object, call _GDIPlus_ArrowCapDispose() to release the object resources.
fr: Après en avoir terminé avec l’objet, appelez la fonction _GDIPlus_ArrowCapDispose() pour libérer les ressources de l’objet.

source: Search GdipCreateAdjustableArrowCap in MSDN Library
fr: Consultez GdipCreateAdjustableArrowCap dans la Library MSDN.

source: Create resources
fr: Crée des ressources

source: Show pen end cap
fr: Affiche la pointe de flèche

source: Draw arrows
fr: Dessine des flèches

source: Clean up resources
fr: Nettoie les ressources

source: Release an adjustable arrow line cap object
fr: Libère les ressources de l'objet 'embout de flèche'

source: Handle to an adjustable arrow line cap object
fr: Handle de l'embout de flèche

source: True.
fr: Retourne True

source: False and sets the @error flag to non-zero, @extended may contain GPSTATUS error code ($GPID_ERR*).
fr: Retourne False et @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*)

source: Search GdipDeleteCustomLineCap in MSDN Library
fr: Consultez GdipDeleteCustomLineCap dans la Library MSDN.

source: Determines whether the arrow cap is filled
fr: Obtient l'état de remplissage de l'embout d'une flèche

source: Handle to a ArrowCap object
fr: Handle de l'objet embout de flèche

source: Arrow cap is filled.
fr: Embout de flèche plein

source: Arrow cap is not filled or if error then @error flag is set.
fr: Embout de flèche creux, ou en cas d'erreur, @error <> 0

source: Search GdipGetAdjustableArrowCapFillState in MSDN Library
fr: Consultez GdipGetAdjustableArrowCapFillState dans la Library MSDN.

source: Show fill state
fr: Affiche l'état de remplissage

source: Draw arrow 1
fr: Dessine flèche 1

source: Draw arrow 2
fr: Dessine flèche 2

source: Gets the height of the arrow cap
fr: Obtient la hauteur de l'embout de flèche

source: the height of the arrow cap.
fr: Retourne la hauteur de l'embout de flèche

source: 0 and sets the @error flag to non-zero, @extended may contain GPSTATUS error code ($GPID_ERR*).
fr: Retourne 0 et @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*)

source: The height is the distance from the base of the arrow to its vertex.
fr: La hauteur est la distance entre la base et le sommet du triangle isocèle

source: Search GdipGetAdjustableArrowCapHeight in MSDN Library
fr: Consultez GdipGetAdjustableArrowCapHeight dans la Library MSDN

source: Draw arrow 3
fr: Dessine flèche 3

source: Gets the value of the inset
fr: Obtient la valeur du déport de l'embout d'une flèche, s'il possède l'option 'plein'

source: the middle inset value.
fr: Retourne la valeur du déport (voir Remarques).

source: The middle inset is the number of units that the midpoint of the base shifts towards the vertex.
fr: Le déport est le nombre d'unités qui mesure le déplacement du milieu de la base vers la pointe.

source: A positive (greater than zero) middle inset results in a shift the specified number of units toward the vertex -- the base is an arrow shape that points toward the vertex, giving the arrow cap a V-shape.
fr: Un déport de zéro n’entraîne pas de changement, la base est une ligne droite, donnant à l’embout de la flèche une forme triangulaire.

source: A negative (less than zero) middle inset results in a shift the specified number of units away from the vertex -- the base becomes an arrow shape that points away from the vertex, giving the arrow either a diamond shape (if the absolute value of the middle inset is equal to the height) or distorted diamond shape.
fr: Un déport positif (supérieur à zéro) entraîne un déplacement, du nombre spécifié d'unités, vers la pointe, la base prend la forme d’une flèche dirigée vers la pointe, donnant à l'embout de flèche une forme en V.

source: If the middle inset is equal to or greater than the height of the arrow cap, the cap does not appear at all.
fr: Un déport négatif (inférieur à zéro) entraine un déplacement, du nombre spécifié d'unités, dans la direction opposé à la pointe — la base devient une forme de flèche qui dirigée à l’opposé de la pointe, donnant à la flèche la forme d’un losange (si la valeur absolue du déport est égale à la hauteur) ou d’un losange déformée.

source: The value of the middle inset affects the arrow cap only if the arrow cap is filled.
fr: Si le déport est égal ou supérieure à la hauteur de l'embout de flèche, l’embout ne s’affiche pas du tout.

source: _GDIPlus_ArrowCapSetMiddleInset()
fr: Lien

source: Search GdipGetAdjustableArrowCapMiddleInset in MSDN Library
fr: Voir aussi

source: Gets the width of the arrow cap
fr: Obtient la largeur de l'embout de la flèche

source: the width of the arrow cap.
fr: Retourne la largeur de l'embout de la flèche

source: The width is the distance between the endpoints of the base of the arrow.
fr: La largeur est la distance, en unités, entre les coins de la base.

source: Search GdipGetAdjustableArrowCapWidth in MSDN Library
fr: Consultez GdipGetAdjustableArrowCapWidth dans la Library MSDN.

source: Sets whether the arrow cap is filled
fr: Définit l'état de remplissage de l'embout de flèche

source: Fill state:
fr: Etat de remplissage:

source: True - Arrow cap is filled
fr: True - Embout plein

source: False - Arrow cap is not filled
fr: False - Embout creux

source: Search GdipSetAdjustableArrowCapFillState in MSDN Library
fr: Consultez GdipSetAdjustableArrowCapFillState dans la Library MSDN.

source: Sets the height of the arrow cap
fr: Définit la longueur de l'embout de flèche

source: Search GdipSetAdjustableArrowCapHeight in MSDN Library
fr: Consultez GdipSetAdjustableArrowCapHeight dans la Library MSDN.

source: Sets the width of the arrow cap
fr: Définit la largeur de l'embout d'une flèche

source: Specifies the width, in units, of the arrow between the endpoints of the base of the arrow
fr: Spécifie la distance, en unités, entre les coins du triangle qui représente l'embout

source: Search GdipSetAdjustableArrowCapWidth in MSDN Library
fr: Consultez GdipSetAdjustableArrowCapWidth dans la Library MSDN

source: Alters a Bitmap by applying a specified effect
fr: Modifie un bitmap en appliquant l'effet spécifié

source: Handle to a Bitmap to which the effect is applied.
fr: Handle du Bitmap auquel l'effet est appliqué.

source: Handle to an Effect to be applied.
fr: Handle de l'effet à appliquer.

source: a $tagRECT structure that specifies the portion of the input bitmap to which the effect is applied.
fr: Structure $tagRECT qui spécifie la partie du bitmap d'entrée à laquelle l'effet est appliqué.

source: -1 - GDIPlus.dll does not support this function.
fr: -1 - GDIPlus.dll ne supporte pas cette fonction.

source: 10 - Invalid parameters.
fr: 10 - Paramètres invalides.

source: Pass Null to the $tRECT parameter to specify that the effect applies to the entire input bitmap (Default).
fr: Passez Null pour le paramètre $tRect pour spécifier que l'effet s'applique au bitmap d'entrée entier (par défaut).

source: Search GdipBitmapApplyEffect in MSDN Library
fr: Consultez GdipBitmapApplyEffect dans la Librairie MSDN.

source: The X coordinate of the upper left corner of the portion to which the effect is applied.
fr: La coordonnée X du coin supérieur gauche de la partie à laquelle l'effet est appliqué.

source: The Y coordinate of the upper left corner of the portion to which the effect is applied.
fr: La coordonnée Y du coin supérieur gauche de la partie à laquelle l'effet est appliqué.

source: Specifies the width of the portion to which the effect is applied.
fr: Spécifie la largeur de la partie à laquelle l'effet est appliqué.

source: Specifies the height of the portion to which the effect is applied.
fr: Spécifie la hauteur de la partie à laquelle l'effet est appliqué.

source: Pass 0 to the coordinate parameters to specify that the effect applies to the entire input bitmap (Default).
fr: Passez 0 dans les paramètres des coordonnées pour spécifier que l'effet s'applique au bitmap d'entrée entier (par défaut).

source: Create a clone of a Bitmap object from the coordinates and format specified
fr: Crée un clone d'un objet Bitmap à partir des coordonnées et d'un format spécifiés

source: Handle to a Bitmap object
fr: Handle de l'objet Bitmap

source: X coordinate of upper left corner of the rectangle to copy
fr: Coordonnée X du coin supérieur gauche du rectangle à copier

source: Y coordinate of upper left corner of the rectangle to copy
fr: Coordonnée Y du coin supérieur gauche du rectangle à copier

source: The width of the rectangle that specifies the portion of this bitmap to copy
fr: Largeur du rectangle qui spécifie la partie du Bitmat à copier

source: The height of the rectangle that specifies the portion of this bitmap to copy
fr: Hauteur du rectangle qui spécifie la partie du Bitmat à copier

source: Pixel format for the new bitmap:
fr: Format de pixel pour le nouveau Bitmap:

source: $GDIP_PXF01INDEXED = 1 bit per pixel, indexed
fr: $GDIP_PXF01INDEXED = 1 bit par pixel, indexé

source: $GDIP_PXF04INDEXED = 4 bits per pixel, indexed
fr: $GDIP_PXF04INDEXED = 4 bits par pixel, indexé

source: $GDIP_PXF08INDEXED = 8 bits per pixel, indexed
fr: $GDIP_PXF08INDEXED = 8 bits par pixel, indexé

source: $GDIP_PXF16GRAYSCALE = 16 bits per pixel, grayscale
fr: $GDIP_PXF16GRAYSCALE = 16 bits par pixel, Niveaux de gris

source: $GDIP_PXF16RGB555 = 16 bits per pixel; 5 bits for each RGB component
fr: $GDIP_PXF16RGB555 = 16 bits par pixel; 5 bits pour chaque composante RVB

source: $GDIP_PXF16RGB565 = 16 bits per pixel; 5 bits for red, 6 bits for green and 5 bits blue
fr: $GDIP_PXF16RGB565 = 16 bits par pixel; 5 bits pour le rouge, 6 bits pour le vert et 5 bits pour le bleu

source: $GDIP_PXF16ARGB1555 = 16 bits per pixel; 1 bit for alpha and 5 bits for each RGB component
fr: $GDIP_PXF16ARGB1555 = 16 bits par pixel; 1 bit pour la transparence et 5 bits pour chaque composante RVB

source: $GDIP_PXF24RGB = 24 bits per pixel; 8 bits for each RGB component
fr: $GDIP_PXF24RGB = 24 bits par pixel; 8 bits pour chaque composante RVB

source: $GDIP_PXF32RGB = 32 bits per pixel; 8 bits for each RGB component.
fr: $GDIP_PXF32RGB = 32 bits par pixel; 8 bits pour chaque composante RVB.

source: No alpha component.
fr: Pas de composante de transparence.

source: $GDIP_PXF32ARGB = 32 bits per pixel; 8 bits for each RGB and alpha component
fr: $GDIP_PXF32ARGB = 32 bits par pixel; 8 bits pour chaque composante RVB et composante de transparence

source: $GDIP_PXF32PARGB = 32 bits per pixel; 8 bits for each RGB and alpha component, pre-multiplied
fr: $GDIP_PXF32PARGB = 32 bits par pixel; 8 bits pour chaque composante RVB et composante de transparence, pré-multiplié

source: $GDIP_PXF48RGB = 48 bits per pixel; 16 bits for each RGB component
fr: $GDIP_PXF48RGB = 48 bits par pixel; 16 bits pour chaque composante RVB

source: $GDIP_PXF64ARGB = 64 bits per pixel; 16 bits for each RGB and alpha component
fr: $GDIP_PXF64ARGB = 64 bits par pixel; 16 bits pour chaque composante RVB et composante de transparence

source: $GDIP_PXF64PARGB = 64 bits per pixel; 16 bits for each RGB and alpha component, pre-multiplied
fr: $GDIP_PXF64PARGB = 64 bits par pixel; 16 bits pour chaque composante RVB et composante de transparence, pré-multiplié

source: a handle to a new Bitmap object.
fr: Retourne le handle du nouvel objet Bitmap

source: When you are done with the Bitmap object, call _GDIPlus_BitmapDispose() to release the resources
fr: Lorsque vous en avez terminé avec l'objet Bitmap, appelez _GDIPlus_BitmapDispose() pour libérer les ressources.

source: Search GdipCloneBitmapAreaI in MSDN Library
fr: Consultez GdipCloneBitmapAreaI dans la Librairie MSDN.
